tutorials/KrogstadWindTunnelCase/0/fmm
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      fmm;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 4 -4 0 0 0 0 ];

internalField   uniform 1.00E-4;

boundaryField
{
    top
    {
        type            zeroGradient;
        value           $internalField;
    }
    ground
    {
        type            zeroGradient;
        value           $internalField;
    }
    inflow
    {
        type            fixedValue;
        value           $internalField;
    }
    outflow
    {
        type            zeroGradient; 
        value           $internalField;
    }
    walls
    {
        type            zeroGradient;
        value           $internalField;
    }
}


// ************************************************************************* //
