tutorials/KrogstadWindTunnelCase/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.0006;

boundaryField
{
    top
    {
        type            slip;
    }

    ground
    {
        type            slip;
    }

    walls
    {
        type          slip;
    }

    inflow
    {
        type            fixedValue;
        value           $internalField;
    }

    outflow
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
