tutorials/KrogstadWindTunnelCase/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{    
    top
    {
        type            slip;
    }

    ground
    {
        type            slip;
    }

    walls
    {
        type            slip;
    }

    inflow
    {
        type            zeroGradient;
        value           uniform 0.0;
    }

    outflow
    {
        type            fixedValue;
        value           uniform 0.0;
    }
}

// ************************************************************************* //
