tutorials/KrogstadWindTunnelCase/constant/airfoilProperties/NREL_S826_RE150k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      airfoilProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

airfoilData
(
//   alpha   C_l    C_d

//OLD stuff
(	-180	0.06071417	0.144935804	)
(	-175	0.683149354	0.223494484	)
(	-170	0.928282469	0.347798399	)
(	-165	0.876270897	0.474706056	)
(	-160	0.86638623	0.625519981	)
(	-155	0.932875429	0.801019306	)
(	-150	0.965101832	0.968482989	)
(	-145	1.065080328	1.223262604	)
(	-140	1.033453269	1.380786017	)
(	-135	0.99045269	1.550840714	)
(	-130	1.010102237	1.8461881	)
(	-125	0.921449778	2.014625072	)
(	-120	0.876373732	2.3099946	)
(	-115	0.70719892	2.381675796	)
(	-110	0.579517763	2.571831823	)
(	-105	0.462316413	2.944685439	)
(	-100	0.218925014	2.712260366	)
(	-95	0.027345624	2.653372613	)
(	-90	-0.157828368	2.651386307	)
(	-85	-0.332434523	2.621073481	)
(	-80	-0.518367271	2.659001736	)
(	-75	-0.684962546	2.576263452	)
(	-70	-0.832539981	2.449826422	)
(	-65	-0.949149778	2.288297396	)
(	-60	-1.106781022	2.291931148	)
(	-55	-1.089470183	1.913289952	)

//New values RE = 150000
(	-50	-0.5618	0.42319	)
(	-45	-0.5746	0.40718	)
(	-40	-0.572	0.38815	)
(	-35	-0.6866	0.35	)
(	-30	-0.6599	0.33	)
(	-25	-0.5875	0.30408	)
(	-24	-0.5693	0.28892	)
(	-23	-0.5499	0.27379	)
(	-22	-0.5299	0.2605	)
(	-21	-0.5089	0.24523	)
(	-20	-0.4884	0.23142	)
(	-19	-0.4673	0.21873	)
(	-18	-0.4463	0.20672	)
(	-17	-0.4259	0.19531	)
(	-16	-0.407	0.18402	)
(	-15	-0.3903	0.17176	)
(	-14	-0.3761	0.15909	)
(	-13	-0.3657	0.14591	)
(	-12	-0.3602	0.13246	)
(	-11	-0.3495	0.11741	)
(	-10	-0.3154	0.09622	)
(	-9	-0.3241	0.06865	)
(	-8	-0.374	0.0479	)
(	-7	-0.3117	0.031	)
(	-6	-0.1924	0.02214	)
(	-5	-0.0414	0.01755	)
(	-4	0.1263	0.01456	)
(	-3	0.2669	0.01342	)
(	-2	0.3876	0.01356	)
(	-1	0.5031	0.01365	)
(	0	0.6163	0.01389	)
(	1	0.7294	0.01421	)
(	2	0.8404	0.01463	)
(	3	0.9507	0.01523	)
(	4	1.0564	0.01578	)
(	5	1.1548	0.01652	)
(	6	1.2431	0.01759	)
(	7	1.2868	0.02065	)
(	8	1.3202	0.02479	)
(	9	1.3531	0.0294	)
(	10	1.382	0.03496	)
(	11	1.4049	0.04184	)
(	12	1.4139	0.05072	)
(	13	1.4182	0.06071	)
(	14	1.4104	0.07477	)
(	15	1.3974	0.09068	)
(	16	1.3805	0.10802	)
(	17	1.3516	0.12859	)
(	18	1.303	0.15818	)
(	19	1.2158	0.2092	)
(	20	1.1291	0.27792	)
(	21	1.1146	0.3075	)
(	22	0.9623	0.30917	)
(	23	0.9327	0.31481	)
(	24	0.9137	0.32209	)
(	25	0.8969	0.32839	)
(	30	0.8723	0.3684	)
(	35	0.8598	0.40526	)
(	40	0.8282	0.43727	)
(	45	0.7952	0.47227	)
(	50	0.7476	0.50468	)
//OLD stuff
(	55	1.60097269	2.320797107	)
(	60	1.418212498	2.450651302	)
(	65	1.240684494	2.595659402	)
(	70	1.039209894	2.722961427	)
(	75	0.838773462	2.906541755	)
(	80	0.598364995	2.952011765	)
(	85	0.358578033	3.137988235	)
(	90	0.090599634	3.337229315	)
(	95	-0.150555823	2.936015815	)
(	100	-0.448594735	3.194177435	)
(	105	-0.742829431	3.259712247	)
(	110	-0.978080791	3.062044166	)
(	115	-1.164313095	2.806026422	)
(	120	-1.327900386	2.563311475	)
(	125	-1.467913462	2.324761813	)
(	130	-1.502751148	1.991975892	)
(	135	-1.527525882	1.699897281	)
(	140	-1.557622122	1.459593616	)
(	145	-1.47193379	1.159616991	)
(	150	-1.45242162	0.947607425	)
(	155	-1.298914966	0.6945135	)
(	160	-1.364641099	0.535981485	)
(	165	-1.426565072	0.35643946	)
(	170	-0.973898245	0.198538573	)
(	175	-0.442199653	0.130726854	)
(	180	0.058547898	0.139764517	)

);
