tutorials/KrogstadWindTunnelCase/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;

vertices        
(
    (-3.660 -1.355  0.000)
    ( 7.490 -1.355  0.000)
    ( 7.490  1.355  0.000)
    (-3.660  1.355  0.000)
    (-3.660 -1.355  1.800)
    ( 7.490 -1.355  1.800)
    ( 7.490  1.355  1.800)
    (-3.660  1.355  1.800)

);

blocks          
(
    hex (0 1 2 3 4 5 6 7) (744 180 120) simpleGrading (1 1 1)
);

edges           
(
);

boundary         
(
    ground
    {
	type wall;
	faces
	(
        	(0 3 2 1)
	);
    }
    top
    {
	type wall;
	faces
	(
        	(4 5 6 7)
	);
    }
    inflow 
    {
	type patch;
	faces
	(
        	(0 4 7 3)
	);
    }
    outflow
    {
	type patch;
	faces
	(
        	(1 2 6 5)
	);
    }
    walls
    {
	type wall;
	faces
	(
        	(0 1 5 4)
        	(3 7 6 2)
	);
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
