tutorials/KrogstadWindTunnelCase/constant/turbineArrayProperties.1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbineArrayProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


globalProperties
{
  
    outputControl       "timeStep";
    outputInterval       10;
    
}

turbine1
{
    turbineType         "NORCOWEBTest";
    baseLocation        (0.13 0.0 0.0);
    numBladePoints      46;           
    pointDistType       "uniform";
    pointInterpType	"linear";
    bladeUpdateType	"oldPosition";
    epsilon             0.0214;
    tipRootLossCorrType "none";
    rotationDir         "ccw";
    Azimuth             0.0;
    RotSpeed            1281.8;
    TorqueGen           0.0;
    Pitch		0;
    NacYaw              270.0;
    fluidDensity	1.23;
}
