tutorials/KrogstadWindTunnelCase/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application       pisoFoamTurbine;

startFrom         startTime;

startTime         0;

stopAt            endTime;

endTime           10.0; 

deltaT            0.0005;

writeControl      adjustableRunTime;

writeInterval     0.5;

purgeWrite        0;

writeFormat       binary;

writePrecision    12;

writeCompression  compressed;

timeFormat        general;

timePrecision     12;

runTimeModifiable no;

adjustTimeStep    no;

maxCo             0.5;

maxDeltaT         0.01;

functions
{
  
  testSample
  {
    type sets;
    functionObjectLibs ("libsampling.so");
    setFormat raw;
    interpolationScheme cell;

    fields
    (
    	U
	k
    );

    sets
    (
	ratio1-hor
    	{
	type        midPoint;
        axis        y;
        start       (0.89 -1.36 0.82);
        end         (0.89 1.355 0.82);
	nPoints     50;
    	}
	
	ratio3-hor
    	{
	type        midPoint;
        axis        y;
        start       (2.68 -1.36 0.82);
        end         (2.68 1.355 0.82);
	nPoints     50;
    	}

	ratio5-hor
    	{
	type        midPoint;
        axis        y;
        start       (4.47 -1.36 0.82);
        end         (4.47 1.355 0.82);
	nPoints     50;
    	}
 
	ratio1-vert
    	{
	type        midPoint;
        axis        z;
        start       (0.89 0 0);
        end         (0.89 0 1.85);
	nPoints     50;
    	}

	ratio2-vert
    	{
	type        midPoint;
        axis        z;
        start       (2.68 0 0);
        end         (2.68 0 1.85);
	nPoints     50;
    	}

	ratio3-vert
    	{
	type        midPoint;
        axis        z;
        start       (4.47 0 0);
        end         (4.47 0 1.85);
	nPoints     50;
    	}

    );
    
    outputControl  timeStep;
    outputInterval 20;
   }
   
}


// ************************************************************************* //
