tutorials/KrogstadWindTunnelCase/system/topoSetDict.2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
   {
	// c0
	name	c0;
	type	cellSet;
	action	new;
        source	boxToCell;
        sourceInfo
	{
		box ( -0.7 -1.355 0.00 ) ( 5.0 1.355 1.8 );
	}
   }
);


// ************************************************************************* //
